//Задача 2: Напишите программу, которая на вход принимает два числа
//  и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите число");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число");
// int number2 =Convert.ToInt32(Console.ReadLine());
// int max=number1;

// if (number1<number2) 
// {
//     max=number2;
// }
// else
// {
//     max=number1;
// }
// Console.Write ("max="+ max);
// Console.Write ($"max={max}"); или этот вариант


// Задача 4: Напишите программу, которая принимает на вход 
// три числа и выдает максимальное из этих чисел.

// Console.WriteLine("Введите число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число");
// int b =Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число");
// int c =Convert.ToInt32(Console.ReadLine());
// int max=a;


// if (b>max) max= b;
// if (c>max) max= c;

// Console.WriteLine(max);

// Задача 6: Напишите программу, которая на вход принимает число и выдает, 
// является ли число четным (делится ли оно на два без остатка).


// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());  

// if (number%2==0)
// {
// Console.WriteLine("ДА");
// }
// else
// {
//     Console.WriteLine("НЕТ");
// }


// Задача 8: Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N.

// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());

// int first = 1;


// while (first<number)
// {
// Console.WriteLine(first+1);
// first+=2;
// }

